//---------------------------------------------------------------------------

#pragma hdrstop

#include "cbxmloption.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)

// ---------------------------------------------------------------------------
__fastcall CCBXMLOption::CCBXMLOption() // 建構函式
{
	// 初值

	ShowLineHead = true;  // 呈現行首資訊 (段首資料)
	ShowLineFormat = true; // 是否呈現原書格式 (反之為段落呈現)
}
// ---------------------------------------------------------------------------
